SOAP_IntegratedConfiguration/request-read.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bas="http://sap.com/xi/BASIS">
  <soapenv:Header/>
  <soapenv:Body>
    <bas:IntegratedConfigurationReadRequest>
      <!-- ReadContext: User (default) or Active -->
      <bas:ReadContext>User</bas:ReadContext>
      <!-- Provide one or more IntegratedConfigurationID blocks -->
      <bas:IntegratedConfigurationID>
        <!-- Optional: <bas:SenderPartyID>YOUR_SENDER_PARTY</bas:SenderPartyID> -->
        <bas:SenderComponentID>YOUR_SENDER_COMPONENT</bas:SenderComponentID>
        <bas:InterfaceName>YOUR_INTERFACE_NAME</bas:InterfaceName>
        <bas:InterfaceNamespace>urn:your:interface:namespace</bas:InterfaceNamespace>
        <!-- Optional Receiver identification -->
        <!-- <bas:ReceiverPartyID>YOUR_RECEIVER_PARTY</bas:ReceiverPartyID> -->
        <!-- <bas:ReceiverComponentID>YOUR_RECEIVER_COMPONENT</bas:ReceiverComponentID> -->
      </bas:IntegratedConfigurationID>
    </bas:IntegratedConfigurationReadRequest>
  </soapenv:Body>
</soapenv:Envelope>
